{
    "version": "https://jsonfeed.org/version/1",
    "title": "Webworm; news as truthful as WHMCS",
    "description": "",
    "home_page_url": "https://webworm.crabdance.com",
    "feed_url": "https://webworm.crabdance.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "GitPear.com"
    },
    "items": [
        {
            "id": "https://webworm.crabdance.com/webpros-completes-acquisition-of-blesta.html",
            "url": "https://webworm.crabdance.com/webpros-completes-acquisition-of-blesta.html",
            "title": "WebPros completes acquisition of Blesta",
            "summary": "WebPros entered a definitive agreement with Blesta in which WebPros would acquire Blesta for the price of $10 Billion. Paul from Blesta promised that every user in the Blesta Discord Community would receive $1 Million from him. Since the acquisition of Blesta was completed, by&hellip;",
            "content_html": "<p>WebPros entered a definitive agreement with Blesta in which WebPros would acquire Blesta for the price of $10 Billion. Paul from Blesta promised that every user in the Blesta Discord Community would receive $1 Million from him.</p>\n<p>Since the acquisition of Blesta was completed, by WebPros, Blesta Owned Licenses were discontinued and Monthly Licenses were bumped up in price by 250%, each having active client limits of at least 250.</p>\n<p>Blesta is now offering a migration tool, to migrate from Blesta to WHMCS, as Blesta will be getting merged with WHMCS in November. For every 10 seconds spent using this migration tool, a $5 invoice will be created. That is, if you spend 250 seconds using the migration tool, you would owe $1,250 to WebPros. WebPros was recently asked why there was a fee for such a thing, here is what they had to say:</p>\n<p>We at WebPros only make quality software. This is why, for users which are using our beautiful migration tool, an invoice will be created, as you are using our precious well-developed high quality industry-leading feature-rich modern cross-compatible software for your own use. Failure to pay this invoice within 2 minutes will result in a 50% increase of the invoice price, because you chose to ignore a very clear notification stating you had an overdue invoice.</p>",
            "author": {
                "name": "GitPear.com"
            },
            "tags": [
            ],
            "date_published": "2021-07-10T17:18:12-05:00",
            "date_modified": "2021-07-10T17:18:12-05:00"
        },
        {
            "id": "https://webworm.crabdance.com/whmcs-discontinues-monthly-licenses.html",
            "url": "https://webworm.crabdance.com/whmcs-discontinues-monthly-licenses.html",
            "title": "WHMCS Discontinues Monthly Licenses",
            "summary": "On July 4th, 2021, we at WHMCS LTD Announced that we would be discontinuing support &amp; updates for leased licenses, including Monthly and Yearly licenses. All Licenses will now cost $15 per week ~ $65.17 per month ~ $782.14 per year. Support will now cost&hellip;",
            "content_html": "<p>On July 4th, 2021, we at WHMCS LTD Announced that we would be discontinuing support &amp; updates for leased licenses, including Monthly and Yearly licenses. </p>\n<p>All Licenses will now cost $15 per week ~ $65.17 per month ~ $782.14 per year.</p>\n<p>Support will now cost $95 per incident and support ticket opened on the billing website, and each new update will have a $10 fee along with a $80 one time payment, which sums up to $90 for a WHMCS version update.</p>\n<p>We at WHMCS also announced that we will be providing free Business Licenses to nonprofit organizations, with an activation fee of $100 per month. As long as that small fee is paid, the nonprofit organization will keep their 'free' business license. There is also now a fixed price per client made, whether it has an active service or not, of $1/month. That is, if you have 1,000 clients, that is $1,000 per month. If you would like to place a new order or access your WHMCS account, you will need to provide your social security number, shoe size (measured in length, centimeters), your eye color, date of birth, bank routing number, and you must pay a $1,543,999 fee as we spend our own valuable time to go through this data.</p>\n<p>FAQ:</p>\n<p><strong>Why are you increasing the price?</strong></p>\n<p>WHMCS is the best software in the world. Not just for billing, but it's just the best. That is why, to continue providing beyond-amazing services, support, and software, our prices need to be configured correctly. This is why we are moving forward with our new pricing structure. Time is valuable, especially to us at WHMCS, which is why we have decided to charge on a weekly basis, starting at $15 / week as mentioned. We do our best to provide WHMCS at the most affordable and reasonable price as possible, but we also need to ensure it is priced correctly, to allow WHMCS to continue to provide the amazing services it currently provides, and to provide even better software in the near future.</p>\n<p> </p>\n<p><strong>What will happen to my monthly license?</strong></p>\n<p>On July 10th, all monthly licenses will be suspended. At the time of suspension, you may still login to your WHMCS Website to recover data, but every megabyte of data recovered will have a fixed fee of $0.99. Accordingly, on July 15th, all licenses will be upgraded to the weekly-based pricing, and you will be charged $15 for the first week, along with a $50 activation fee.</p>\n<p> </p>\n<p>Thank you for understanding. Sincerely, The Best Software in the World, WHMCS.</p>\n<p>[THIS IS A JOKE]</p>\n<p> </p>",
            "author": {
                "name": "GitPear.com"
            },
            "tags": [
            ],
            "date_published": "2021-07-04T15:04:39-05:00",
            "date_modified": "2021-07-04T15:06:43-05:00"
        },
        {
            "id": "https://webworm.crabdance.com/nexusbytes-acquires-burger-king.html",
            "url": "https://webworm.crabdance.com/nexusbytes-acquires-burger-king.html",
            "title": "NexusBytes acquires Burger King",
            "summary": "On July 2nd, 4:20AM and 69 Seconds, \"Burger King\" and \"NexusBytes, LLC.\" entered into a definitive agreement under which NexusBytes will acquire Burger King. As with all important business decisions, we promise to work closely with our clients, partners, and employees to make the integration&hellip;",
            "content_html": "<p>On July 2nd, 4:20AM and 69 Seconds, \"Burger King\" and \"NexusBytes, LLC.\" entered into a definitive agreement under which NexusBytes will acquire Burger King.<br>As with all important business decisions, we promise to work closely with our clients, partners, and employees to make the integration process as seamless as possible. NexusBytes will begin transferring all the infrastructure from Burger King over to NexusBytes.<br>We heard from Nahian, CEO of NexusBytes, just last night. He told us \"It's finally happening, we're acquiring our favorite fast food place. Their website is too damn slow and their machines are old and are falling apart. We're moving them to our Miami Datacenter. Their website will run on our new blazing fast DirectAdmin web hosting. Their burgers will no longer contain artificial meat and will be powered by NVMe Drives, with DDR4 Buns and AMD Ryzen Sauce. I cannot express my excitement. Burger King, here we come.\"</p>\n<p>Nahian made it very clear that Burger King's website and machines would be much faster with the power of NVMe Burger Meat &amp; a DirectAdmin-powered website.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>[THIS IS A JOKE]</p>",
            "author": {
                "name": "GitPear.com"
            },
            "tags": [
            ],
            "date_published": "2021-07-02T14:09:13-05:00",
            "date_modified": "2021-07-02T14:20:47-05:00"
        },
        {
            "id": "https://webworm.crabdance.com/eig-announces-acquisition-of-namehero.html",
            "url": "https://webworm.crabdance.com/eig-announces-acquisition-of-namehero.html",
            "title": "EIG Announces Acquisition of NameHero",
            "summary": " EIG official statement: On July 2nd, 4:20AM and 69 Seconds, \"EIG\" and \"Name Hero, LLC.\" entered into a definitive agreement under which EIG will acquire NameHero. As with all important business decisions, we promise to work closely with our clients, partners, and employees to&hellip;",
            "content_html": "\n  <p>\n    EIG official statement:\n  </p>\n\n  <p>\n    On July 2nd, 4:20AM and 69 Seconds, \"EIG\" and \"Name Hero, LLC.\" entered into a definitive agreement under which EIG will acquire NameHero.<br>As with all important business decisions, we promise to work closely with our clients, partners,\n<br>and employees to make the integration process as seamless as possible. EIG will&nbsp;begin transferring all the infrastructure from NameHero over to HostGator.<br>We do not&nbsp;expect this to interrupt existing client services, however, your website will probably go down for a few days or something. Not our fault tho.\n  </p>\n\n  <p>\n    All existing services will have their prices kept at where they are for 48 hours, however, after this 48 hour period, all prices will increase by approximately 598%. You may be required to pay a $1,000 transfer fee, to account for the time of us transferring all of your data to HostGator.\n  </p>\n\n  <p>\n    Thank you for understanding, we look forward to continue to work with NameHero.\n  </p>\n\n  <p>\n    \n  </p>\n\n  <p>\n    \n  </p>\n\n  <p>\n    \n  </p>\n\n  <p>\n    [THIS IS A JOKE]\n  </p>",
            "author": {
                "name": "GitPear.com"
            },
            "tags": [
            ],
            "date_published": "2021-07-02T13:38:06-05:00",
            "date_modified": "2021-07-02T14:23:34-05:00"
        }
    ]
}
