{
    "version": "https://jsonfeed.org/version/1",
    "title": "Webworm; news as truthful as WHMCS",
    "description": "",
    "home_page_url": "https://webworm.crabdance.com",
    "feed_url": "https://webworm.crabdance.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "GitPear.com"
    },
    "items": [
        {
            "id": "https://webworm.crabdance.com/eig-announces-acquisition-of-namehero.html",
            "url": "https://webworm.crabdance.com/eig-announces-acquisition-of-namehero.html",
            "title": "EIG Announces Acquisition of NameHero",
            "summary": " EIG official statement: On July 2nd, 4:20AM and 69 Seconds, \"EIG\" and \"Name Hero, LLC.\" entered into a definitive agreement under which EIG will acquire NameHero. As with all important business decisions, we promise to work closely with our clients, partners, and employees to&hellip;",
            "content_html": "\n  <p>\n    EIG official statement:\n  </p>\n\n  <p>\n    On July 2nd, 4:20AM and 69 Seconds, \"EIG\" and \"Name Hero, LLC.\" entered into a definitive agreement under which EIG will acquire NameHero.<br>As with all important business decisions, we promise to work closely with our clients, partners,\n<br>and employees to make the integration process as seamless as possible. EIG will&nbsp;begin transferring all the infrastructure from NameHero over to HostGator.<br>We do not&nbsp;expect this to interrupt existing client services, however, your website will probably go down for a few days or something. Not our fault tho.\n  </p>\n\n  <p>\n    All existing services will have their prices kept at where they are for 48 hours, however, after this 48 hour period, all prices will increase by approximately 598%. You may be required to pay a $1,000 transfer fee, to account for the time of us transferring all of your data to HostGator.\n  </p>\n\n  <p>\n    Thank you for understanding, we look forward to continue to work with NameHero.\n  </p>",
            "author": {
                "name": "GitPear.com"
            },
            "tags": [
            ],
            "date_published": "2021-07-02T13:38:06-05:00",
            "date_modified": "2021-07-02T13:38:06-05:00"
        }
    ]
}
